using System;

namespace exercises_array11
{
    class Program
    {
        static void Main(string[] args)
        {
            /*11) Написать программу, которая будет спрашивать имя и возраст двух человек, 
                после чего спросит, человек с каким именем старше ? (одно из ранее введенных).
                После ввода имени, программа должна вывести ответ, правильно или не правильно, и написать, кто старше, и на сколько.
                Предусмотреть ввод невалидных данных, и повторное отображение вопроса с повторным вводом при вводе невалидных данных.*/
        }
    }
}
